GopalSaraf/Practicals/PSDL/include/proc/pic16f18326.h
extern volatile EEDATHbits_t EEDATHbits __at(0x894);
// bitfield macros
#define _EEDATH_NVMDATH_POSN                                0x0
#define _EEDATH_NVMDATH_POSITION                            0x0
#define _EEDATH_NVMDATH_SIZE                                0x6
#define _EEDATH_NVMDATH_LENGTH                              0x6
#define _EEDATH_NVMDATH_MASK                                0x3F
#define _EEDATH_NVMDAT8_POSN                                0x0
#define _EEDATH_NVMDAT8_POSITION                            0x0
#define _EEDATH_NVMDAT8_SIZE                                0x1
#define _EEDATH_NVMDAT8_LENGTH                              0x1
#define _EEDATH_NVMDAT8_MASK                                0x1
#define _EEDATH_NVMDAT9_POSN                                0x1
#define _EEDATH_NVMDAT9_POSITION                            0x1
#define _EEDATH_NVMDAT9_SIZE                                0x1
#define _EEDATH_NVMDAT9_LENGTH                              0x1
#define _EEDATH_NVMDAT9_MASK                                0x2
#define _EEDATH_NVMDAT10_POSN                               0x2
#define _EEDATH_NVMDAT10_POSITION                           0x2
#define _EEDATH_NVMDAT10_SIZE                               0x1
#define _EEDATH_NVMDAT10_LENGTH                             0x1
#define _EEDATH_NVMDAT10_MASK                               0x4
#define _EEDATH_NVMDAT11_POSN                               0x3
#define _EEDATH_NVMDAT11_POSITION                           0x3
#define _EEDATH_NVMDAT11_SIZE                               0x1
#define _EEDATH_NVMDAT11_LENGTH                             0x1
#define _EEDATH_NVMDAT11_MASK                               0x8
#define _EEDATH_NVMDAT12_POSN                               0x4
#define _EEDATH_NVMDAT12_POSITION                           0x4
#define _EEDATH_NVMDAT12_SIZE                               0x1
#define _EEDATH_NVMDAT12_LENGTH                             0x1
#define _EEDATH_NVMDAT12_MASK                               0x10
#define _EEDATH_NVMDAT13_POSN                               0x5
#define _EEDATH_NVMDAT13_POSITION                           0x5
#define _EEDATH_NVMDAT13_SIZE                               0x1
#define _EEDATH_NVMDAT13_LENGTH                             0x1
#define _EEDATH_NVMDAT13_MASK                               0x20
#define _EEDATH_EEDATH_POSN                                 0x0
#define _EEDATH_EEDATH_POSITION                             0x0
#define _EEDATH_EEDATH_SIZE                                 0x6
#define _EEDATH_EEDATH_LENGTH                               0x6
#define _EEDATH_EEDATH_MASK                                 0x3F
#define _EEDATH_PMDATH_POSN                                 0x0
#define _EEDATH_PMDATH_POSITION                             0x0
#define _EEDATH_PMDATH_SIZE                                 0x6
#define _EEDATH_PMDATH_LENGTH                               0x6
#define _EEDATH_PMDATH_MASK                                 0x3F
typedef union {
    struct {
        unsigned NVMDATH                :6;
    };
    struct {
        unsigned NVMDAT8                :1;
        unsigned NVMDAT9                :1;
        unsigned NVMDAT10               :1;
        unsigned NVMDAT11               :1;
        unsigned NVMDAT12               :1;
        unsigned NVMDAT13               :1;
    };
    struct {
        unsigned EEDATH                 :6;
    };
    struct {
        unsigned PMDATH                 :6;
    };
} PMDATHbits_t;
extern volatile PMDATHbits_t PMDATHbits __at(0x894);
// bitfield macros
#define _PMDATH_NVMDATH_POSN                                0x0
#define _PMDATH_NVMDATH_POSITION                            0x0
#define _PMDATH_NVMDATH_SIZE                                0x6
#define _PMDATH_NVMDATH_LENGTH                              0x6
#define _PMDATH_NVMDATH_MASK                                0x3F
#define _PMDATH_NVMDAT8_POSN                                0x0
#define _PMDATH_NVMDAT8_POSITION                            0x0
#define _PMDATH_NVMDAT8_SIZE                                0x1
#define _PMDATH_NVMDAT8_LENGTH                              0x1
#define _PMDATH_NVMDAT8_MASK                                0x1
#define _PMDATH_NVMDAT9_POSN                                0x1
#define _PMDATH_NVMDAT9_POSITION                            0x1
#define _PMDATH_NVMDAT9_SIZE                                0x1
#define _PMDATH_NVMDAT9_LENGTH                              0x1
#define _PMDATH_NVMDAT9_MASK                                0x2
#define _PMDATH_NVMDAT10_POSN                               0x2
#define _PMDATH_NVMDAT10_POSITION                           0x2
#define _PMDATH_NVMDAT10_SIZE                               0x1
#define _PMDATH_NVMDAT10_LENGTH                             0x1
#define _PMDATH_NVMDAT10_MASK                               0x4
#define _PMDATH_NVMDAT11_POSN                               0x3
#define _PMDATH_NVMDAT11_POSITION                           0x3
#define _PMDATH_NVMDAT11_SIZE                               0x1
#define _PMDATH_NVMDAT11_LENGTH                             0x1
#define _PMDATH_NVMDAT11_MASK                               0x8
#define _PMDATH_NVMDAT12_POSN                               0x4
#define _PMDATH_NVMDAT12_POSITION                           0x4
#define _PMDATH_NVMDAT12_SIZE                               0x1
#define _PMDATH_NVMDAT12_LENGTH                             0x1
#define _PMDATH_NVMDAT12_MASK                               0x10
#define _PMDATH_NVMDAT13_POSN                               0x5
#define _PMDATH_NVMDAT13_POSITION                           0x5
#define _PMDATH_NVMDAT13_SIZE                               0x1
#define _PMDATH_NVMDAT13_LENGTH                             0x1
#define _PMDATH_NVMDAT13_MASK                               0x20
#define _PMDATH_EEDATH_POSN                                 0x0
#define _PMDATH_EEDATH_POSITION                             0x0
#define _PMDATH_EEDATH_SIZE                                 0x6
#define _PMDATH_EEDATH_LENGTH                               0x6
#define _PMDATH_EEDATH_MASK                                 0x3F
#define _PMDATH_PMDATH_POSN                                 0x0
#define _PMDATH_PMDATH_POSITION                             0x0
#define _PMDATH_PMDATH_SIZE                                 0x6
#define _PMDATH_PMDATH_LENGTH                               0x6
#define _PMDATH_PMDATH_MASK                                 0x3F

// Register: NVMCON1
#define NVMCON1 NVMCON1
extern volatile unsigned char           NVMCON1             __at(0x895);
#ifndef _LIB_BUILD
asm("NVMCON1 equ 0895h");
#endif
// aliases
extern volatile unsigned char           EECON1              __at(0x895);
#ifndef _LIB_BUILD
asm("EECON1 equ 0895h");
#endif
extern volatile unsigned char           PMCON1              __at(0x895);
#ifndef _LIB_BUILD
asm("PMCON1 equ 0895h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
        unsigned LWLO                   :1;
        unsigned NVMREGS                :1;
    };
    struct {
        unsigned                        :6;
        unsigned CFGS                   :1;
    };
} NVMCON1bits_t;
extern volatile NVMCON1bits_t NVMCON1bits __at(0x895);
// bitfield macros
#define _NVMCON1_RD_POSN                                    0x0
#define _NVMCON1_RD_POSITION                                0x0
#define _NVMCON1_RD_SIZE                                    0x1
#define _NVMCON1_RD_LENGTH                                  0x1
#define _NVMCON1_RD_MASK                                    0x1
#define _NVMCON1_WR_POSN                                    0x1
#define _NVMCON1_WR_POSITION                                0x1
#define _NVMCON1_WR_SIZE                                    0x1
#define _NVMCON1_WR_LENGTH                                  0x1
#define _NVMCON1_WR_MASK                                    0x2
#define _NVMCON1_WREN_POSN                                  0x2
#define _NVMCON1_WREN_POSITION                              0x2
#define _NVMCON1_WREN_SIZE                                  0x1
#define _NVMCON1_WREN_LENGTH                                0x1
#define _NVMCON1_WREN_MASK                                  0x4
#define _NVMCON1_WRERR_POSN                                 0x3
#define _NVMCON1_WRERR_POSITION                             0x3
#define _NVMCON1_WRERR_SIZE                                 0x1
#define _NVMCON1_WRERR_LENGTH                               0x1
#define _NVMCON1_WRERR_MASK                                 0x8
#define _NVMCON1_FREE_POSN                                  0x4
#define _NVMCON1_FREE_POSITION                              0x4
#define _NVMCON1_FREE_SIZE                                  0x1
#define _NVMCON1_FREE_LENGTH                                0x1
#define _NVMCON1_FREE_MASK                                  0x10
#define _NVMCON1_LWLO_POSN                                  0x5
#define _NVMCON1_LWLO_POSITION                              0x5
#define _NVMCON1_LWLO_SIZE                                  0x1
#define _NVMCON1_LWLO_LENGTH                                0x1
#define _NVMCON1_LWLO_MASK                                  0x20
#define _NVMCON1_NVMREGS_POSN                               0x6
#define _NVMCON1_NVMREGS_POSITION                           0x6
#define _NVMCON1_NVMREGS_SIZE                               0x1
#define _NVMCON1_NVMREGS_LENGTH                             0x1
#define _NVMCON1_NVMREGS_MASK                               0x40
#define _NVMCON1_CFGS_POSN                                  0x6
#define _NVMCON1_CFGS_POSITION                              0x6
#define _NVMCON1_CFGS_SIZE                                  0x1
#define _NVMCON1_CFGS_LENGTH                                0x1
#define _NVMCON1_CFGS_MASK                                  0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
        unsigned LWLO                   :1;
        unsigned NVMREGS                :1;
    };
    struct {
        unsigned                        :6;
        unsigned CFGS                   :1;
    };
} EECON1bits_t;
