GopalSaraf/Practicals/PSDL/include/proc/pic16f18326.h
// Register: CWG2PPS
#define CWG2PPS CWG2PPS
extern volatile unsigned char           CWG2PPS             __at(0xE19);
#ifndef _LIB_BUILD
asm("CWG2PPS equ 0E19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG2PPS                :5;
    };
    struct {
        unsigned CWG2PPS0               :1;
        unsigned CWG2PPS1               :1;
        unsigned CWG2PPS2               :1;
        unsigned CWG2PPS3               :1;
        unsigned CWG2PPS4               :1;
    };
} CWG2PPSbits_t;
extern volatile CWG2PPSbits_t CWG2PPSbits __at(0xE19);
// bitfield macros
#define _CWG2PPS_CWG2PPS_POSN                               0x0
#define _CWG2PPS_CWG2PPS_POSITION                           0x0
#define _CWG2PPS_CWG2PPS_SIZE                               0x5
#define _CWG2PPS_CWG2PPS_LENGTH                             0x5
#define _CWG2PPS_CWG2PPS_MASK                               0x1F
#define _CWG2PPS_CWG2PPS0_POSN                              0x0
#define _CWG2PPS_CWG2PPS0_POSITION                          0x0
#define _CWG2PPS_CWG2PPS0_SIZE                              0x1
#define _CWG2PPS_CWG2PPS0_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS0_MASK                              0x1
#define _CWG2PPS_CWG2PPS1_POSN                              0x1
#define _CWG2PPS_CWG2PPS1_POSITION                          0x1
#define _CWG2PPS_CWG2PPS1_SIZE                              0x1
#define _CWG2PPS_CWG2PPS1_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS1_MASK                              0x2
#define _CWG2PPS_CWG2PPS2_POSN                              0x2
#define _CWG2PPS_CWG2PPS2_POSITION                          0x2
#define _CWG2PPS_CWG2PPS2_SIZE                              0x1
#define _CWG2PPS_CWG2PPS2_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS2_MASK                              0x4
#define _CWG2PPS_CWG2PPS3_POSN                              0x3
#define _CWG2PPS_CWG2PPS3_POSITION                          0x3
#define _CWG2PPS_CWG2PPS3_SIZE                              0x1
#define _CWG2PPS_CWG2PPS3_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS3_MASK                              0x8
#define _CWG2PPS_CWG2PPS4_POSN                              0x4
#define _CWG2PPS_CWG2PPS4_POSITION                          0x4
#define _CWG2PPS_CWG2PPS4_SIZE                              0x1
#define _CWG2PPS_CWG2PPS4_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS4_MASK                              0x10

// Register: MDCIN1PPS
#define MDCIN1PPS MDCIN1PPS
extern volatile unsigned char           MDCIN1PPS           __at(0xE1A);
#ifndef _LIB_BUILD
asm("MDCIN1PPS equ 0E1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCIN1PPS              :5;
    };
    struct {
        unsigned MDCIN1PPS0             :1;
        unsigned MDCIN1PPS1             :1;
        unsigned MDCIN1PPS2             :1;
        unsigned MDCIN1PPS3             :1;
        unsigned MDCIN1PPS4             :1;
    };
} MDCIN1PPSbits_t;
extern volatile MDCIN1PPSbits_t MDCIN1PPSbits __at(0xE1A);
// bitfield macros
#define _MDCIN1PPS_MDCIN1PPS_POSN                           0x0
#define _MDCIN1PPS_MDCIN1PPS_POSITION                       0x0
#define _MDCIN1PPS_MDCIN1PPS_SIZE                           0x5
#define _MDCIN1PPS_MDCIN1PPS_LENGTH                         0x5
#define _MDCIN1PPS_MDCIN1PPS_MASK                           0x1F
#define _MDCIN1PPS_MDCIN1PPS0_POSN                          0x0
#define _MDCIN1PPS_MDCIN1PPS0_POSITION                      0x0
#define _MDCIN1PPS_MDCIN1PPS0_SIZE                          0x1
#define _MDCIN1PPS_MDCIN1PPS0_LENGTH                        0x1
#define _MDCIN1PPS_MDCIN1PPS0_MASK                          0x1
#define _MDCIN1PPS_MDCIN1PPS1_POSN                          0x1
#define _MDCIN1PPS_MDCIN1PPS1_POSITION                      0x1
#define _MDCIN1PPS_MDCIN1PPS1_SIZE                          0x1
#define _MDCIN1PPS_MDCIN1PPS1_LENGTH                        0x1
#define _MDCIN1PPS_MDCIN1PPS1_MASK                          0x2
#define _MDCIN1PPS_MDCIN1PPS2_POSN                          0x2
#define _MDCIN1PPS_MDCIN1PPS2_POSITION                      0x2
#define _MDCIN1PPS_MDCIN1PPS2_SIZE                          0x1
#define _MDCIN1PPS_MDCIN1PPS2_LENGTH                        0x1
#define _MDCIN1PPS_MDCIN1PPS2_MASK                          0x4
#define _MDCIN1PPS_MDCIN1PPS3_POSN                          0x3
#define _MDCIN1PPS_MDCIN1PPS3_POSITION                      0x3
#define _MDCIN1PPS_MDCIN1PPS3_SIZE                          0x1
#define _MDCIN1PPS_MDCIN1PPS3_LENGTH                        0x1
#define _MDCIN1PPS_MDCIN1PPS3_MASK                          0x8
#define _MDCIN1PPS_MDCIN1PPS4_POSN                          0x4
#define _MDCIN1PPS_MDCIN1PPS4_POSITION                      0x4
#define _MDCIN1PPS_MDCIN1PPS4_SIZE                          0x1
#define _MDCIN1PPS_MDCIN1PPS4_LENGTH                        0x1
#define _MDCIN1PPS_MDCIN1PPS4_MASK                          0x10

// Register: MDCIN2PPS
#define MDCIN2PPS MDCIN2PPS
extern volatile unsigned char           MDCIN2PPS           __at(0xE1B);
#ifndef _LIB_BUILD
asm("MDCIN2PPS equ 0E1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCIN2PPS              :5;
    };
    struct {
        unsigned MDCIN2PPS0             :1;
        unsigned MDCIN2PPS1             :1;
        unsigned MDCIN2PPS2             :1;
        unsigned MDCIN2PPS3             :1;
        unsigned MDCIN2PPS4             :1;
    };
} MDCIN2PPSbits_t;
extern volatile MDCIN2PPSbits_t MDCIN2PPSbits __at(0xE1B);
// bitfield macros
#define _MDCIN2PPS_MDCIN2PPS_POSN                           0x0
#define _MDCIN2PPS_MDCIN2PPS_POSITION                       0x0
#define _MDCIN2PPS_MDCIN2PPS_SIZE                           0x5
#define _MDCIN2PPS_MDCIN2PPS_LENGTH                         0x5
#define _MDCIN2PPS_MDCIN2PPS_MASK                           0x1F
#define _MDCIN2PPS_MDCIN2PPS0_POSN                          0x0
#define _MDCIN2PPS_MDCIN2PPS0_POSITION                      0x0
#define _MDCIN2PPS_MDCIN2PPS0_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS0_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS0_MASK                          0x1
#define _MDCIN2PPS_MDCIN2PPS1_POSN                          0x1
#define _MDCIN2PPS_MDCIN2PPS1_POSITION                      0x1
#define _MDCIN2PPS_MDCIN2PPS1_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS1_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS1_MASK                          0x2
#define _MDCIN2PPS_MDCIN2PPS2_POSN                          0x2
#define _MDCIN2PPS_MDCIN2PPS2_POSITION                      0x2
#define _MDCIN2PPS_MDCIN2PPS2_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS2_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS2_MASK                          0x4
#define _MDCIN2PPS_MDCIN2PPS3_POSN                          0x3
#define _MDCIN2PPS_MDCIN2PPS3_POSITION                      0x3
#define _MDCIN2PPS_MDCIN2PPS3_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS3_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS3_MASK                          0x8
#define _MDCIN2PPS_MDCIN2PPS4_POSN                          0x4
#define _MDCIN2PPS_MDCIN2PPS4_POSITION                      0x4
#define _MDCIN2PPS_MDCIN2PPS4_SIZE                          0x1
#define _MDCIN2PPS_MDCIN2PPS4_LENGTH                        0x1
#define _MDCIN2PPS_MDCIN2PPS4_MASK                          0x10

