GopalSaraf/Practicals/PSDL/include/proc/pic16f18326.h
// SSP1BUF<SSP1BUF7>
extern volatile __bit                   SSP1BUF7            __at(0x108F);	// @ (0x211 * 8 + 7)
#define                                 SSP1BUF7_bit        _BIT_ACCESS(SSP1BUF,7)
// SSP1CLKPPS<SSP1CLKPPS0>
extern volatile __bit                   SSP1CLKPPS0         __at(0x7100);	// @ (0xE20 * 8 + 0)
#define                                 SSP1CLKPPS0_bit     _BIT_ACCESS(SSP1CLKPPS,0)
// SSP1CLKPPS<SSP1CLKPPS1>
extern volatile __bit                   SSP1CLKPPS1         __at(0x7101);	// @ (0xE20 * 8 + 1)
#define                                 SSP1CLKPPS1_bit     _BIT_ACCESS(SSP1CLKPPS,1)
// SSP1CLKPPS<SSP1CLKPPS2>
extern volatile __bit                   SSP1CLKPPS2         __at(0x7102);	// @ (0xE20 * 8 + 2)
#define                                 SSP1CLKPPS2_bit     _BIT_ACCESS(SSP1CLKPPS,2)
// SSP1CLKPPS<SSP1CLKPPS3>
extern volatile __bit                   SSP1CLKPPS3         __at(0x7103);	// @ (0xE20 * 8 + 3)
#define                                 SSP1CLKPPS3_bit     _BIT_ACCESS(SSP1CLKPPS,3)
// SSP1CLKPPS<SSP1CLKPPS4>
extern volatile __bit                   SSP1CLKPPS4         __at(0x7104);	// @ (0xE20 * 8 + 4)
#define                                 SSP1CLKPPS4_bit     _BIT_ACCESS(SSP1CLKPPS,4)
// SSP1DATPPS<SSP1DATPPS0>
extern volatile __bit                   SSP1DATPPS0         __at(0x7108);	// @ (0xE21 * 8 + 0)
#define                                 SSP1DATPPS0_bit     _BIT_ACCESS(SSP1DATPPS,0)
// SSP1DATPPS<SSP1DATPPS1>
extern volatile __bit                   SSP1DATPPS1         __at(0x7109);	// @ (0xE21 * 8 + 1)
#define                                 SSP1DATPPS1_bit     _BIT_ACCESS(SSP1DATPPS,1)
// SSP1DATPPS<SSP1DATPPS2>
extern volatile __bit                   SSP1DATPPS2         __at(0x710A);	// @ (0xE21 * 8 + 2)
#define                                 SSP1DATPPS2_bit     _BIT_ACCESS(SSP1DATPPS,2)
// SSP1DATPPS<SSP1DATPPS3>
extern volatile __bit                   SSP1DATPPS3         __at(0x710B);	// @ (0xE21 * 8 + 3)
#define                                 SSP1DATPPS3_bit     _BIT_ACCESS(SSP1DATPPS,3)
// SSP1DATPPS<SSP1DATPPS4>
extern volatile __bit                   SSP1DATPPS4         __at(0x710C);	// @ (0xE21 * 8 + 4)
#define                                 SSP1DATPPS4_bit     _BIT_ACCESS(SSP1DATPPS,4)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x8B);	// @ (0x11 * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// SSP1MSK<SSP1MSK0>
extern volatile __bit                   SSP1MSK0            __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 SSP1MSK0_bit        _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<SSP1MSK1>
extern volatile __bit                   SSP1MSK1            __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 SSP1MSK1_bit        _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<SSP1MSK2>
extern volatile __bit                   SSP1MSK2            __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 SSP1MSK2_bit        _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<SSP1MSK3>
extern volatile __bit                   SSP1MSK3            __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 SSP1MSK3_bit        _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<SSP1MSK4>
extern volatile __bit                   SSP1MSK4            __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 SSP1MSK4_bit        _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<SSP1MSK5>
extern volatile __bit                   SSP1MSK5            __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 SSP1MSK5_bit        _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<SSP1MSK6>
extern volatile __bit                   SSP1MSK6            __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 SSP1MSK6_bit        _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<SSP1MSK7>
extern volatile __bit                   SSP1MSK7            __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 SSP1MSK7_bit        _BIT_ACCESS(SSP1MSK,7)
// SSP1SSPPS<SSP1SSPPS0>
extern volatile __bit                   SSP1SSPPS0          __at(0x7110);	// @ (0xE22 * 8 + 0)
#define                                 SSP1SSPPS0_bit      _BIT_ACCESS(SSP1SSPPS,0)
// SSP1SSPPS<SSP1SSPPS1>
extern volatile __bit                   SSP1SSPPS1          __at(0x7111);	// @ (0xE22 * 8 + 1)
#define                                 SSP1SSPPS1_bit      _BIT_ACCESS(SSP1SSPPS,1)
// SSP1SSPPS<SSP1SSPPS2>
extern volatile __bit                   SSP1SSPPS2          __at(0x7112);	// @ (0xE22 * 8 + 2)
#define                                 SSP1SSPPS2_bit      _BIT_ACCESS(SSP1SSPPS,2)
// SSP1SSPPS<SSP1SSPPS3>
extern volatile __bit                   SSP1SSPPS3          __at(0x7113);	// @ (0xE22 * 8 + 3)
#define                                 SSP1SSPPS3_bit      _BIT_ACCESS(SSP1SSPPS,3)
// SSP1SSPPS<SSP1SSPPS4>
extern volatile __bit                   SSP1SSPPS4          __at(0x7114);	// @ (0xE22 * 8 + 4)
#define                                 SSP1SSPPS4_bit      _BIT_ACCESS(SSP1SSPPS,4)
// SSP2ADD<SSP2ADD0>
extern volatile __bit                   SSP2ADD0            __at(0x10D0);	// @ (0x21A * 8 + 0)
#define                                 SSP2ADD0_bit        _BIT_ACCESS(SSP2ADD,0)
// SSP2ADD<SSP2ADD1>
extern volatile __bit                   SSP2ADD1            __at(0x10D1);	// @ (0x21A * 8 + 1)
#define                                 SSP2ADD1_bit        _BIT_ACCESS(SSP2ADD,1)
// SSP2ADD<SSP2ADD2>
extern volatile __bit                   SSP2ADD2            __at(0x10D2);	// @ (0x21A * 8 + 2)
#define                                 SSP2ADD2_bit        _BIT_ACCESS(SSP2ADD,2)
// SSP2ADD<SSP2ADD3>
extern volatile __bit                   SSP2ADD3            __at(0x10D3);	// @ (0x21A * 8 + 3)
#define                                 SSP2ADD3_bit        _BIT_ACCESS(SSP2ADD,3)
// SSP2ADD<SSP2ADD4>
extern volatile __bit                   SSP2ADD4            __at(0x10D4);	// @ (0x21A * 8 + 4)
#define                                 SSP2ADD4_bit        _BIT_ACCESS(SSP2ADD,4)
// SSP2ADD<SSP2ADD5>
extern volatile __bit                   SSP2ADD5            __at(0x10D5);	// @ (0x21A * 8 + 5)
#define                                 SSP2ADD5_bit        _BIT_ACCESS(SSP2ADD,5)
// SSP2ADD<SSP2ADD6>
extern volatile __bit                   SSP2ADD6            __at(0x10D6);	// @ (0x21A * 8 + 6)
#define                                 SSP2ADD6_bit        _BIT_ACCESS(SSP2ADD,6)
// SSP2ADD<SSP2ADD7>
extern volatile __bit                   SSP2ADD7            __at(0x10D7);	// @ (0x21A * 8 + 7)
#define                                 SSP2ADD7_bit        _BIT_ACCESS(SSP2ADD,7)
// SSP2BUF<SSP2BUF0>
extern volatile __bit                   SSP2BUF0            __at(0x10C8);	// @ (0x219 * 8 + 0)
#define                                 SSP2BUF0_bit        _BIT_ACCESS(SSP2BUF,0)
// SSP2BUF<SSP2BUF1>
extern volatile __bit                   SSP2BUF1            __at(0x10C9);	// @ (0x219 * 8 + 1)
#define                                 SSP2BUF1_bit        _BIT_ACCESS(SSP2BUF,1)
// SSP2BUF<SSP2BUF2>
extern volatile __bit                   SSP2BUF2            __at(0x10CA);	// @ (0x219 * 8 + 2)
#define                                 SSP2BUF2_bit        _BIT_ACCESS(SSP2BUF,2)
// SSP2BUF<SSP2BUF3>
extern volatile __bit                   SSP2BUF3            __at(0x10CB);	// @ (0x219 * 8 + 3)
#define                                 SSP2BUF3_bit        _BIT_ACCESS(SSP2BUF,3)
// SSP2BUF<SSP2BUF4>
extern volatile __bit                   SSP2BUF4            __at(0x10CC);	// @ (0x219 * 8 + 4)
#define                                 SSP2BUF4_bit        _BIT_ACCESS(SSP2BUF,4)
// SSP2BUF<SSP2BUF5>
extern volatile __bit                   SSP2BUF5            __at(0x10CD);	// @ (0x219 * 8 + 5)
#define                                 SSP2BUF5_bit        _BIT_ACCESS(SSP2BUF,5)
// SSP2BUF<SSP2BUF6>
extern volatile __bit                   SSP2BUF6            __at(0x10CE);	// @ (0x219 * 8 + 6)
#define                                 SSP2BUF6_bit        _BIT_ACCESS(SSP2BUF,6)
// SSP2BUF<SSP2BUF7>
extern volatile __bit                   SSP2BUF7            __at(0x10CF);	// @ (0x219 * 8 + 7)
#define                                 SSP2BUF7_bit        _BIT_ACCESS(SSP2BUF,7)
// SSP2CLKPPS<SSP2CLKPPS0>
extern volatile __bit                   SSP2CLKPPS0         __at(0x70E8);	// @ (0xE1D * 8 + 0)
#define                                 SSP2CLKPPS0_bit     _BIT_ACCESS(SSP2CLKPPS,0)
// SSP2CLKPPS<SSP2CLKPPS1>
extern volatile __bit                   SSP2CLKPPS1         __at(0x70E9);	// @ (0xE1D * 8 + 1)
#define                                 SSP2CLKPPS1_bit     _BIT_ACCESS(SSP2CLKPPS,1)
// SSP2CLKPPS<SSP2CLKPPS2>
extern volatile __bit                   SSP2CLKPPS2         __at(0x70EA);	// @ (0xE1D * 8 + 2)
#define                                 SSP2CLKPPS2_bit     _BIT_ACCESS(SSP2CLKPPS,2)
// SSP2CLKPPS<SSP2CLKPPS3>
extern volatile __bit                   SSP2CLKPPS3         __at(0x70EB);	// @ (0xE1D * 8 + 3)
#define                                 SSP2CLKPPS3_bit     _BIT_ACCESS(SSP2CLKPPS,3)
// SSP2CLKPPS<SSP2CLKPPS4>
extern volatile __bit                   SSP2CLKPPS4         __at(0x70EC);	// @ (0xE1D * 8 + 4)
#define                                 SSP2CLKPPS4_bit     _BIT_ACCESS(SSP2CLKPPS,4)
// SSP2DATPPS<SSP2DATPPS0>
extern volatile __bit                   SSP2DATPPS0         __at(0x70F0);	// @ (0xE1E * 8 + 0)
#define                                 SSP2DATPPS0_bit     _BIT_ACCESS(SSP2DATPPS,0)
// SSP2DATPPS<SSP2DATPPS1>
extern volatile __bit                   SSP2DATPPS1         __at(0x70F1);	// @ (0xE1E * 8 + 1)
#define                                 SSP2DATPPS1_bit     _BIT_ACCESS(SSP2DATPPS,1)
// SSP2DATPPS<SSP2DATPPS2>
extern volatile __bit                   SSP2DATPPS2         __at(0x70F2);	// @ (0xE1E * 8 + 2)
#define                                 SSP2DATPPS2_bit     _BIT_ACCESS(SSP2DATPPS,2)
// SSP2DATPPS<SSP2DATPPS3>
extern volatile __bit                   SSP2DATPPS3         __at(0x70F3);	// @ (0xE1E * 8 + 3)
#define                                 SSP2DATPPS3_bit     _BIT_ACCESS(SSP2DATPPS,3)
// SSP2DATPPS<SSP2DATPPS4>
extern volatile __bit                   SSP2DATPPS4         __at(0x70F4);	// @ (0xE1E * 8 + 4)
#define                                 SSP2DATPPS4_bit     _BIT_ACCESS(SSP2DATPPS,4)
// PIE2<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x493);	// @ (0x92 * 8 + 3)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x93);	// @ (0x12 * 8 + 3)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR2,3)
// SSP2MSK<SSP2MSK0>
extern volatile __bit                   SSP2MSK0            __at(0x10D8);	// @ (0x21B * 8 + 0)
#define                                 SSP2MSK0_bit        _BIT_ACCESS(SSP2MSK,0)
// SSP2MSK<SSP2MSK1>
extern volatile __bit                   SSP2MSK1            __at(0x10D9);	// @ (0x21B * 8 + 1)
#define                                 SSP2MSK1_bit        _BIT_ACCESS(SSP2MSK,1)
// SSP2MSK<SSP2MSK2>
extern volatile __bit                   SSP2MSK2            __at(0x10DA);	// @ (0x21B * 8 + 2)
#define                                 SSP2MSK2_bit        _BIT_ACCESS(SSP2MSK,2)
// SSP2MSK<SSP2MSK3>
extern volatile __bit                   SSP2MSK3            __at(0x10DB);	// @ (0x21B * 8 + 3)
#define                                 SSP2MSK3_bit        _BIT_ACCESS(SSP2MSK,3)
// SSP2MSK<SSP2MSK4>
extern volatile __bit                   SSP2MSK4            __at(0x10DC);	// @ (0x21B * 8 + 4)
#define                                 SSP2MSK4_bit        _BIT_ACCESS(SSP2MSK,4)
// SSP2MSK<SSP2MSK5>
extern volatile __bit                   SSP2MSK5            __at(0x10DD);	// @ (0x21B * 8 + 5)
#define                                 SSP2MSK5_bit        _BIT_ACCESS(SSP2MSK,5)
// SSP2MSK<SSP2MSK6>
extern volatile __bit                   SSP2MSK6            __at(0x10DE);	// @ (0x21B * 8 + 6)
#define                                 SSP2MSK6_bit        _BIT_ACCESS(SSP2MSK,6)
// SSP2MSK<SSP2MSK7>
extern volatile __bit                   SSP2MSK7            __at(0x10DF);	// @ (0x21B * 8 + 7)
#define                                 SSP2MSK7_bit        _BIT_ACCESS(SSP2MSK,7)
// SSP2SSPPS<SSP2SSPPS0>
extern volatile __bit                   SSP2SSPPS0          __at(0x70F8);	// @ (0xE1F * 8 + 0)
#define                                 SSP2SSPPS0_bit      _BIT_ACCESS(SSP2SSPPS,0)
// SSP2SSPPS<SSP2SSPPS1>
extern volatile __bit                   SSP2SSPPS1          __at(0x70F9);	// @ (0xE1F * 8 + 1)
#define                                 SSP2SSPPS1_bit      _BIT_ACCESS(SSP2SSPPS,1)
// SSP2SSPPS<SSP2SSPPS2>
extern volatile __bit                   SSP2SSPPS2          __at(0x70FA);	// @ (0xE1F * 8 + 2)
#define                                 SSP2SSPPS2_bit      _BIT_ACCESS(SSP2SSPPS,2)
// SSP2SSPPS<SSP2SSPPS3>
extern volatile __bit                   SSP2SSPPS3          __at(0x70FB);	// @ (0xE1F * 8 + 3)
#define                                 SSP2SSPPS3_bit      _BIT_ACCESS(SSP2SSPPS,3)
// SSP2SSPPS<SSP2SSPPS4>
extern volatile __bit                   SSP2SSPPS4          __at(0x70FC);	// @ (0xE1F * 8 + 4)
#define                                 SSP2SSPPS4_bit      _BIT_ACCESS(SSP2SSPPS,4)
// PCON0<STKOVF>
extern volatile __bit                   STKOVF              __at(0x44DF);	// @ (0x89B * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON0,7)
// PCON0<STKUNF>
extern volatile __bit                   STKUNF              __at(0x44DE);	// @ (0x89B * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON0,6)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// TX1STA<SYNC>
extern volatile __bit                   SYNC                __at(0xCF4);	// @ (0x19E * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TX1STA,4)
// PMD0<SYSCMD>
extern volatile __bit                   SYSCMD              __at(0x488F);	// @ (0x911 * 8 + 7)
#define                                 SYSCMD_bit          _BIT_ACCESS(PMD0,7)
// T0CON0<T016BIT>
extern volatile __bit                   T016BIT             __at(0xBC);	// @ (0x17 * 8 + 4)
#define                                 T016BIT_bit         _BIT_ACCESS(T0CON0,4)
// T0CON1<T0ASYNC>
extern volatile __bit                   T0ASYNC             __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 T0ASYNC_bit         _BIT_ACCESS(T0CON1,4)
// T0CKIPPS<T0CKIPPS0>
extern volatile __bit                   T0CKIPPS0           __at(0x7088);	// @ (0xE11 * 8 + 0)
#define                                 T0CKIPPS0_bit       _BIT_ACCESS(T0CKIPPS,0)
// T0CKIPPS<T0CKIPPS1>
extern volatile __bit                   T0CKIPPS1           __at(0x7089);	// @ (0xE11 * 8 + 1)
#define                                 T0CKIPPS1_bit       _BIT_ACCESS(T0CKIPPS,1)
// T0CKIPPS<T0CKIPPS2>
extern volatile __bit                   T0CKIPPS2           __at(0x708A);	// @ (0xE11 * 8 + 2)
#define                                 T0CKIPPS2_bit       _BIT_ACCESS(T0CKIPPS,2)
// T0CKIPPS<T0CKIPPS3>
extern volatile __bit                   T0CKIPPS3           __at(0x708B);	// @ (0xE11 * 8 + 3)
#define                                 T0CKIPPS3_bit       _BIT_ACCESS(T0CKIPPS,3)
// T0CKIPPS<T0CKIPPS4>
extern volatile __bit                   T0CKIPPS4           __at(0x708C);	// @ (0xE11 * 8 + 4)
#define                                 T0CKIPPS4_bit       _BIT_ACCESS(T0CKIPPS,4)
// T0CON1<T0CKPS0>
extern volatile __bit                   T0CKPS0             __at(0xC0);	// @ (0x18 * 8 + 0)
#define                                 T0CKPS0_bit         _BIT_ACCESS(T0CON1,0)
// T0CON1<T0CKPS1>
extern volatile __bit                   T0CKPS1             __at(0xC1);	// @ (0x18 * 8 + 1)
#define                                 T0CKPS1_bit         _BIT_ACCESS(T0CON1,1)
// T0CON1<T0CKPS2>
extern volatile __bit                   T0CKPS2             __at(0xC2);	// @ (0x18 * 8 + 2)
#define                                 T0CKPS2_bit         _BIT_ACCESS(T0CON1,2)
// T0CON1<T0CKPS3>
extern volatile __bit                   T0CKPS3             __at(0xC3);	// @ (0x18 * 8 + 3)
#define                                 T0CKPS3_bit         _BIT_ACCESS(T0CON1,3)
// T0CON1<T0CS0>
extern volatile __bit                   T0CS0               __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 T0CS0_bit           _BIT_ACCESS(T0CON1,5)
// T0CON1<T0CS1>
extern volatile __bit                   T0CS1               __at(0xC6);	// @ (0x18 * 8 + 6)
#define                                 T0CS1_bit           _BIT_ACCESS(T0CON1,6)
// T0CON1<T0CS2>
extern volatile __bit                   T0CS2               __at(0xC7);	// @ (0x18 * 8 + 7)
#define                                 T0CS2_bit           _BIT_ACCESS(T0CON1,7)
// T0CON0<T0EN>
extern volatile __bit                   T0EN                __at(0xBF);	// @ (0x17 * 8 + 7)
#define                                 T0EN_bit            _BIT_ACCESS(T0CON0,7)
// T0CON0<T0OUT>
extern volatile __bit                   T0OUT               __at(0xBD);	// @ (0x17 * 8 + 5)
#define                                 T0OUT_bit           _BIT_ACCESS(T0CON0,5)
// T0CON0<T0OUTPS0>
extern volatile __bit                   T0OUTPS0            __at(0xB8);	// @ (0x17 * 8 + 0)
#define                                 T0OUTPS0_bit        _BIT_ACCESS(T0CON0,0)
// T0CON0<T0OUTPS1>
extern volatile __bit                   T0OUTPS1            __at(0xB9);	// @ (0x17 * 8 + 1)
#define                                 T0OUTPS1_bit        _BIT_ACCESS(T0CON0,1)
// T0CON0<T0OUTPS2>
extern volatile __bit                   T0OUTPS2            __at(0xBA);	// @ (0x17 * 8 + 2)
#define                                 T0OUTPS2_bit        _BIT_ACCESS(T0CON0,2)
// T0CON0<T0OUTPS3>
extern volatile __bit                   T0OUTPS3            __at(0xBB);	// @ (0x17 * 8 + 3)
#define                                 T0OUTPS3_bit        _BIT_ACCESS(T0CON0,3)
// T1CKIPPS<T1CKIPPS0>
extern volatile __bit                   T1CKIPPS0           __at(0x7090);	// @ (0xE12 * 8 + 0)
#define                                 T1CKIPPS0_bit       _BIT_ACCESS(T1CKIPPS,0)
// T1CKIPPS<T1CKIPPS1>
extern volatile __bit                   T1CKIPPS1           __at(0x7091);	// @ (0xE12 * 8 + 1)
#define                                 T1CKIPPS1_bit       _BIT_ACCESS(T1CKIPPS,1)
// T1CKIPPS<T1CKIPPS2>
extern volatile __bit                   T1CKIPPS2           __at(0x7092);	// @ (0xE12 * 8 + 2)
#define                                 T1CKIPPS2_bit       _BIT_ACCESS(T1CKIPPS,2)
// T1CKIPPS<T1CKIPPS3>
extern volatile __bit                   T1CKIPPS3           __at(0x7093);	// @ (0xE12 * 8 + 3)
#define                                 T1CKIPPS3_bit       _BIT_ACCESS(T1CKIPPS,3)
// T1CKIPPS<T1CKIPPS4>
extern volatile __bit                   T1CKIPPS4           __at(0x7094);	// @ (0xE12 * 8 + 4)
#define                                 T1CKIPPS4_bit       _BIT_ACCESS(T1CKIPPS,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0xDC);	// @ (0x1B * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0xDD);	// @ (0x1B * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO_nDONE>
extern volatile __bit                   T1GGO_nDONE         __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 T1GGO_nDONE_bit     _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0xE6);	// @ (0x1C * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GPPS<T1GPPS0>
extern volatile __bit                   T1GPPS0             __at(0x7098);	// @ (0xE13 * 8 + 0)
#define                                 T1GPPS0_bit         _BIT_ACCESS(T1GPPS,0)
// T1GPPS<T1GPPS1>
extern volatile __bit                   T1GPPS1             __at(0x7099);	// @ (0xE13 * 8 + 1)
#define                                 T1GPPS1_bit         _BIT_ACCESS(T1GPPS,1)
// T1GPPS<T1GPPS2>
extern volatile __bit                   T1GPPS2             __at(0x709A);	// @ (0xE13 * 8 + 2)
#define                                 T1GPPS2_bit         _BIT_ACCESS(T1GPPS,2)
// T1GPPS<T1GPPS3>
extern volatile __bit                   T1GPPS3             __at(0x709B);	// @ (0xE13 * 8 + 3)
#define                                 T1GPPS3_bit         _BIT_ACCESS(T1GPPS,3)
// T1GPPS<T1GPPS4>
extern volatile __bit                   T1GPPS4             __at(0x709C);	// @ (0xE13 * 8 + 4)
#define                                 T1GPPS4_bit         _BIT_ACCESS(T1GPPS,4)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0xE4);	// @ (0x1C * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0xE1);	// @ (0x1C * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0xE5);	// @ (0x1C * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0xE2);	// @ (0x1C * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T1CON<T1SOSC>
extern volatile __bit                   T1SOSC              __at(0xDB);	// @ (0x1B * 8 + 3)
#define                                 T1SOSC_bit          _BIT_ACCESS(T1CON,3)
// T1CON<T1SYNC>
extern volatile __bit                   T1SYNC              __at(0xDA);	// @ (0x1B * 8 + 2)
#define                                 T1SYNC_bit          _BIT_ACCESS(T1CON,2)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,0)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,1)
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 T2OUTPS0_bit        _BIT_ACCESS(T2CON,3)
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 T2OUTPS1_bit        _BIT_ACCESS(T2CON,4)
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0xFD);	// @ (0x1F * 8 + 5)
#define                                 T2OUTPS2_bit        _BIT_ACCESS(T2CON,5)
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0xFE);	// @ (0x1F * 8 + 6)
#define                                 T2OUTPS3_bit        _BIT_ACCESS(T2CON,6)
// T3CON<T3CKPS0>
extern volatile __bit                   T3CKPS0             __at(0x209C);	// @ (0x413 * 8 + 4)
#define                                 T3CKPS0_bit         _BIT_ACCESS(T3CON,4)
// T3CON<T3CKPS1>
extern volatile __bit                   T3CKPS1             __at(0x209D);	// @ (0x413 * 8 + 5)
